* No derailment (Move between segments)
** Elapsed time
|-------------------------+-------+--------+-------+--------------|
| Configuration           | First | Second | Third |      Average |
|-------------------------+-------+--------+-------+--------------|
| Example with one train  | 0.005 |  0.004 | 0.003 | 8.6666667e-3 |
| Example with two trains | 0.036 |  0.046 | 0.040 |  0.064333333 |
| Shared Segment          | 0.014 |  0.014 | 0.016 |        0.038 |
| Large Network           | 0.019 |  0.018 | 0.017 |  0.033333333 |
| Station One             | 0.015 |  0.018 | 0.018 |  0.035666667 |
| Station Two             | 0.125 |  0.133 | 0.149 |   0.36466667 |
| Station Four            | 2.321 |  2.735 | 2.390 |    11.708333 |
| Station Six             |       |        |       |    254.67733 |
| Station Eight           |       |        |       |    1594.7723 |
| Station Ten             |       |        |       |    6163.9547 |
| Nærumbanen (2T)         |       |        |       |    132.67567 |
| Nærumbanen (3T)         |       |        |       |    4585.1813 |
|-------------------------+-------+--------+-------+--------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|-------------------------+--------+--------+--------+-----------|
| Configuration           |  First | Second |  Third |   Average |
|-------------------------+--------+--------+--------+-----------|
| Example with one train  |  7.656 |  7.676 |  7.676 | 9.3133333 |
| Example with two trains |  8.404 |  8.412 |  8.420 | 10.130667 |
| Shared Segment          |  9.924 |  9.956 |  9.960 | 11.930667 |
| Large Network           | 11.924 | 11.972 | 11.980 | 13.913333 |
| Station One             |  8.360 |  8.364 |  8.372 | 10.066667 |
| Station Two             | 12.254 | 12.572 | 12.584 | 16.369333 |
| Station Four            | 37.716 | 37.956 | 37.964 | 59.801333 |
| Station Six             |        |        |        | 212.28933 |
| Station Eight           |        |        |        | 541.72133 |
| Station Ten             |        |        |        | 1177.9827 |
| Nærumbanen (2T)         |        |        |        |   153.712 |
| Nærumbanen (3T)         |        |        |        |  1303.408 |
|-------------------------+--------+--------+--------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No derailment (Critical section)
** Elapsed time
|-------------------------+-------+--------+-------+--------------|
| Configuration           | First | Second | Third |      Average |
|-------------------------+-------+--------+-------+--------------|
| Example with one train  | 0.004 |  0.004 | 0.005 | 5.3333333e-3 |
| Example with two trains | 0.026 |  0.027 | 0.051 |         0.06 |
| Shared Segment          | 0.021 |  0.020 | 0.022 |        0.038 |
| Large Network           | 0.016 |  0.017 | 0.027 |  0.031666667 |
| Station One             | 0.022 |  0.021 | 0.025 |  0.022333333 |
| Station Two             | 0.125 |  0.134 | 0.164 |   0.36766667 |
| Station Four            | 2.394 |  2.338 | 2.348 |       10.941 |
| Station Six             |       |        |       |      245.934 |
| Station Eight           |       |        |       |     1694.755 |
| Station Ten             |       |        |       |     6160.028 |
| Nærumbanen (2T)         |       |        |       |      133.281 |
| Nærumbanen (3T)         |       |        |       |     4319.844 |
|-------------------------+-------+--------+-------+--------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|-------------------------+--------+--------+--------+-----------|
| Configuration           |  First | Second |  Third |   Average |
|-------------------------+--------+--------+--------+-----------|
| Example with one train  |  7.648 |  7.668 |  7.668 | 7.6653333 |
| Example with two trains |  8.384 |  8.408 |  8.416 | 10.466667 |
| Shared Segment          |  9.904 |  9.932 |  9.936 |     9.968 |
| Large Network           | 11.924 | 11.968 | 11.980 |    11.984 |
| Station One             |  8.328 |  8.356 |  8.360 |     8.416 |
| Station Two             | 12.516 | 12.564 | 12.572 | 15.442667 |
| Station Four            | 37.712 | 37.952 | 37.360 | 58.229333 |
| Station Six             |        |        |        | 209.16267 |
| Station Eight           |        |        |        |   543.076 |
| Station Ten             |        |        |        | 1178.3707 |
| Nærumbanen (2T)         |        |        |        | 152.13867 |
| Nærumbanen (3T)         |        |        |        | 1303.3787 |
|-------------------------+--------+--------+--------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No collision
** Elapsed time
|-------------------------+-------+--------+-------+--------------|
| Configuration           | First | Second | Third |      Average |
|-------------------------+-------+--------+-------+--------------|
| Example with one train  | 0.004 |  0.004 | 0.004 | 6.3333333e-3 |
| Example with two trains | 0.036 |  0.034 | 0.042 |        0.044 |
| Shared Segment          | 0.020 |  0.019 | 0.020 |  0.029333333 |
| Large Network           | 0.019 |  0.027 | 0.025 |        0.031 |
| Station One             | 0.025 |  0.015 | 0.025 |        0.018 |
| Station Two             | 0.125 |  0.129 | 0.128 |        0.351 |
| Station Four            | 2.685 |  2.651 | 2.694 |        11.55 |
| Station Six             |       |        |       |    249.72933 |
| Station Eight           |       |        |       |     1597.767 |
| Station Ten             |       |        |       |     6068.031 |
| Nærumbanen (2T)         |       |        |       |    133.70833 |
| Nærumbanen (3T)         |       |        |       |    4374.0737 |
|-------------------------+-------+--------+-------+--------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|-------------------------+--------+--------+--------+-----------|
| Configuration           |  First | Second |  Third |   Average |
|-------------------------+--------+--------+--------+-----------|
| Example with one train  |  7.632 |  7.652 |  7.656 |     7.656 |
| Example with two trains |  8.392 |  8.400 |  8.408 |     8.428 |
| Shared Segment          |  9.900 |  9.936 | 10.192 |    10.032 |
| Large Network           | 11.920 | 11.972 | 11.980 | 11.985333 |
| Station One             |  8.344 |  8.352 |  8.360 |     8.412 |
| Station Two             | 12.504 | 12.560 | 12.572 |     14.96 |
| Station Four            | 37.696 | 37.892 | 37.948 | 58.201333 |
| Station Six             |        |        |        | 210.05733 |
| Station Eight           |        |        |        | 544.73333 |
| Station Ten             |        |        |        | 1177.5107 |
| Nærumbanen (2T)         |        |        |        | 152.06533 |
| Nærumbanen (3T)         |        |        |        | 1303.3773 |
|-------------------------+--------+--------+--------+-----------|
#+TBLFM: $5=vmean($2..$4)

* Will arrive
** Elapsed time
|-------------------------+-------+--------+-------+--------------|
| Configuration           | First | Second | Third |      Average |
|-------------------------+-------+--------+-------+--------------|
| Example with one train  | 0.003 |  0.004 | 0.003 | 5.6666667e-3 |
| Example with two trains | 0.037 |  0.048 | 0.045 |         0.06 |
| Shared Segment          | 0.021 |  0.021 | 0.021 |  0.018333333 |
| Large Network           | 0.015 |  0.016 | 0.020 |  0.034333333 |
| Station One             | 0.025 |  0.025 | 0.025 |  0.025666667 |
| Station Two             | 0.124 |  0.137 | 0.133 |   0.33966667 |
| Station Four            | 2.578 |  2.538 | 2.654 |        11.78 |
| Station Six             |       |        |       |    260.88367 |
| Station Eight           |       |        |       |    1657.4813 |
| Station Ten             |       |        |       |    5958.8747 |
| Nærumbanen (2T)         |       |        |       |    131.59433 |
| Nærumbanen (3T)         |       |        |       |    4594.8233 |
|-------------------------+-------+--------+-------+--------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|-------------------------+--------+--------+--------+-----------|
| Configuration           |  First | Second |  Third |   Average |
|-------------------------+--------+--------+--------+-----------|
| Example with one train  |  7.572 |  7.580 |  7.580 | 7.5893333 |
| Example with two trains |  8.316 |  8.316 |  8.316 |     8.348 |
| Shared Segment          |  9.828 |  9.848 |  9.852 | 9.8746667 |
| Large Network           | 11.856 | 11.856 | 11.856 |    11.888 |
| Station One             |  8.268 |  8.268 |  8.268 |     8.332 |
| Station Two             | 12.428 | 12.468 | 12.480 |    15.364 |
| Station Four            | 37.624 | 37.808 | 37.816 | 58.926667 |
| Station Six             |        |        |        |   205.772 |
| Station Eight           |        |        |        |   543.112 |
| Station Ten             |        |        |        | 1172.8693 |
| Nærumbanen (2T)         |        |        |        | 151.93067 |
| Nærumbanen (3T)         |        |        |        |    1303.3 |
|-------------------------+--------+--------+--------+-----------|
#+TBLFM: $5=vmean($2..$4)
